## 恢复说明
# 确保 homebrew 存在， /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# 安装 mas，brew install mas
# 批量安装软件命令， brew bundle --file="~/dotfiles/.brewfile"

#----------------------------------------

## 软件仓作用
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "universal-ctags/universal-ctags"

## brew 安装软件
brew "mas"
brew "ctags"
brew "curl"
brew "fzf"
brew "node"
brew "tmux"
brew "tpm"
brew "vim"
brew "zsh"
brew "autojump"
brew "git"
brew "tig"
brew "lazygit"
brew "neovim"
brew "universal-ctags"

## cask 安装软件
cask "microsoft-edge"
cask "visual-studio-code"

cask "--appdir=/Applications docker"


## 该是 Mac App Store 安装的 app
# DEMO
# mas "Xcode", id: 497799835
