## 恢复说明
# 确保 homebrew 存在， /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# 安装 mas，brew install mas
# 批量安装软件命令， brew bundle --file="~/dotfiles/.brewfile"

#----------------------------------------

## 软件仓作用
tap "homebrew/bundle"
tap "universal-ctags/universal-ctags"
# Emacs dependency management
brew "cask"

## brew 安装软件
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Platform built on V8 to build network applications
brew "node"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# Shell extension to jump to frequently used directories
brew "autojump"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# git推送查询
brew "tig"

## cask 安装软件
cask "microsoft-edge"
cask "visual-studio-code"

## 该是 Mac App Store 安装的 app
# DEMO
# mas "Xcode", id: 497799835